In [1]:
import pandas as pd
import csv
import logging

In [3]:
from infraestructure.file_utils import file_to_dataframe
from domain.formatting_utils import column_names_formatting
from domain.explore_utils import info_dataframe

In [4]:
logger = logging.getLogger(__name__)

In [5]:
# Bank dataframe
bank_file = 'bank-additional.csv'
df_bank = file_to_dataframe(bank_file)

In [6]:
df_bank = column_names_formatting(df_bank)
df_bank.head()

,unnamed: 0,age,job,marital,education,default,housing,loan,contact,duration,...,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y,date,latitude,longitude,id
0,0,NaN,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,...,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,089b39d8-e4d0-461b-87d4-814d71e0e079
1,1,57.0,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,...,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,e9d37224-cb6f-4942-98d7-46672963d097
2,2,37.0,services,MARRIED,high.school,0.0,1.0,0.0,telephone,226,...,1.1,"93,994","-36,4","4,857",5191,no,15-febrero-2019,34.939,-94.847,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,3,40.0,admin.,MARRIED,basic.6y,0.0,0.0,0.0,telephone,151,...,1.1,"93,994","-36,4",NaN,5191,no,29-noviembre-2015,49.041,-70.308,9991fafb-4447-451a-8be2-b0df6098d13e
4,4,56.0,services,MARRIED,high.school,0.0,0.0,1.0,telephone,307,...,1.1,"93,994","-36,4",NaN,5191,no,29-enero-2017,38.033,-104.463,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

In [7]:
bank_info = info_dataframe(df_bank)

In [8]:
bank_info

       column_name  non_null_count  null_count  null_percent    dtype
0       unnamed: 0           43000           0          0.00    int64
1              age           37880        5120         11.91  float64
2              job           42655         345          0.80   object
3          marital           42915          85          0.20   object
4        education           41193        1807          4.20   object
5          default           34019        8981         20.89  float64
6          housing           41974        1026          2.39  float64
7             loan           41974        1026          2.39  float64
8          contact           43000           0          0.00   object
9         duration           43000           0          0.00    int64
10        campaign           43000           0          0.00    int64
11           pdays           43000           0          0.00    int64
12        previous           43000           0          0.00    int64
13        poutcome           43000           0          0.00   object
14    emp_var_rate           43000           0          0.00  float64
15  cons_price_idx           42529         471          1.10   object
16   cons_conf_idx           43000           0          0.00   object
17       euribor3m           33744        9256         21.53   object
18     nr_employed           43000           0          0.00   object
19               y           43000           0          0.00   object
20            date           42752         248          0.58   object
21        latitude           43000           0          0.00  float64
22       longitude           43000           0          0.00  float64
23              id           43000           0          0.00   object

In [9]:
file_customer = 'customer-details.xlsx'
sheet_2012 = '2012'

In [10]:
df_customer = file_to_dataframe(file_customer, sheet_2012)

Path: C:\Users\Usuario\OneDrive\Documentos\GitHub\DataProyect_EDA_Python\files\input\customer-details.xlsx